if GetLocale() ~= "ruRU" then return end

local L

------------------------------
--<<<Храм Нефритовой Змеи>>>--
------------------------------

----------------
--Мудрый Марис--
----------------
L= DBM:GetModLocalization(672)

L:SetMiscLocalization{
	YellKill	= "Тьма расступается..."
}

--------------------------------------
--Хранитель истории Каменная Поступь--
--------------------------------------
L= DBM:GetModLocalization(664)

L:SetWarningLocalization({
	SpecWarnIntensity	= "%s на %s (%d)"
})

-----------------------
--Лю Пламенное Сердце--
-----------------------
L= DBM:GetModLocalization(658)

---------------
--Ша Сомнения--
---------------
L= DBM:GetModLocalization(335)

-----------
-- Trash --
-----------
L = DBM:GetModLocalization("JSTTrash")

L:SetTimerLocalization{
    TimerSpeedKill	= "Очищение водой"
}

L:SetGeneralLocalization{
	name = "Трэш ХНЗ"
}

------------------------------------
--<<<Хмелеварня Буйных Портеров>>>--
------------------------------------

---------
--Ук-Ук--
---------
L= DBM:GetModLocalization(668)

--------------
--Прыгопотам--
--------------
L= DBM:GetModLocalization(669)

--------------------------
--Янь-Чжу Высвобожденный--
--------------------------
L= DBM:GetModLocalization(670)

L:SetWarningLocalization({
	SpecWarnFizzyBubbles	= "Возьмите пузырек и взлетайте"
})

L:SetOptionLocalization({
	SpecWarnFizzyBubbles	= "Спец-предупреждение, когда на вас нет $spell:114459"
})

----------------------------
--<<<Монастырь Шадо-Пан>>>--
----------------------------

--------------------
--Гу Небесный Удар--
--------------------
L= DBM:GetModLocalization(673)

L:SetWarningLocalization({
	warnStaticField	= "%s"
})

------------------------
--Мастер Снежный Вихрь--
------------------------
L= DBM:GetModLocalization(657)

L:SetWarningLocalization({
	warnRemainingNovice	= "Осталось учеников: %d"
})

L:SetOptionLocalization({
	warnRemainingNovice	= "Показывать количество оставшихся учеников"
})

L:SetMiscLocalization({
	NovicesPulled	= "Это ваша вина! Вы позволили ша пробудиться после стольких лет!",
	NovicesDefeated = "Вы победили новичков. Теперь вы сразитесь с двумя моими самыми опытными учениками.",
--	Defeat			= "I am bested.  Give me a moment and we will venture forth together to face the Sha."
})

-----------------
--Ша жестокости--
-----------------
L= DBM:GetModLocalization(685)

L:SetMiscLocalization({
	Kill		= "Пока в ваших сердцах есть место жестокости... я могу вернуться..."
})

--------------
--Тажань Чжу--
--------------
L= DBM:GetModLocalization(686)

L:SetOptionLocalization({
	InfoFrame			= "Показывать информационное окно для $journal:5827"
})

---------------------------------
--<<<Врата Заходящего Солнца>>>--
---------------------------------

-----------------------
--Диверсант Кип'тилак--
-----------------------
L= DBM:GetModLocalization(655)

---------------
--Боец Га'док--
---------------
L= DBM:GetModLocalization(675)

L:SetMiscLocalization({
	StaffingRun		= "Боец Га'док заходит на атаку с бреющего полета!"
})

-------------------
--Командир Ри'мок--
-------------------
L= DBM:GetModLocalization(676)

-----------
--Райгонн--
-----------
L= DBM:GetModLocalization(649)

-------------------------
--<<<Дворец Могу'шан>>>--
-------------------------

-------------------------
--Королевское испытание--
-------------------------
L= DBM:GetModLocalization(708)

L:SetMiscLocalization({
	Pull		= "Вы бесполезны! Даже ваша охрана не может преградить этим тварям дорогу в мой дворец.",
	Kuai		= "Клан Гуртан докажет королю и грязным самозванцам, что только он заслуживает королевского доверия!",
	Ming		= "Лучшие могу – в клане Хартак! Сейчас все это увидят!",
	Haiyan		= "Клан Каргеш сейчас покажет, почему только сильным место рядом с королем!",
	Defeat		= "Кто пропустил этих чужаков? На такое вероломство способны только кланы Каргеш и Хартак!"
})

----------
--Геккан--
----------
L= DBM:GetModLocalization(690)

-------------------
--Синь Мастер Боя--
-------------------
L= DBM:GetModLocalization(698)

----------------------------
--<<<Осада храма Нюцзао>>>--
----------------------------

--------------------
--Визирь Цзинь'бак--
--------------------
L= DBM:GetModLocalization(693)

--------------------
--Командир Во'цзак--
--------------------
L= DBM:GetModLocalization(738)

L:SetTimerLocalization({
	TimerWave	= "Подкрепления: %s"
})

L:SetOptionLocalization({
	TimerWave	= "Отсчёт времени до следующей волны подкреплений"
})

L:SetMiscLocalization({
	WaveStart	= "Глупцы! Вы смеете противостоять армии богомолов? Вы быстро умрете!"
})

--------------------
--Генерал Па'валак--
--------------------
L= DBM:GetModLocalization(692)

--------------------------------
--Командующий флангом Нер'онок--
--------------------------------
L= DBM:GetModLocalization(727)
